ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where('slug', $slug)->first();