ci4/app/Controllers/Home.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $artikelModel = new ArtikelModel();
        $data = [
            'title' => 'Halaman Home',
            'content' => 'Ini adalah halaman home yang menjelaskan tentang isi halaman ini.',
            'artikel' => $artikelModel->findAll() // Menyediakan data artikel ke view