ci4/app/Controllers/User.php

SELECT *
FROM `user`
WHERE `useremail` = 'mfaiziqbal01@gmail.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form', 'url']);
        $session = session();
        $model = new UserModel();

        // Cek jika email belum terdaftar, tambahkan user default
        if (!$model->where('useremail', 'mfaiziqbal01@gmail.com')->first()) {